var image1 = document.getElementById("image1");
var image2 = document.getElementById("image2");
var image3 = document.getElementById("image3");
var image4 = document.getElementById("image4");
var price = document.getElementById("price");
var text = document.getElementById("text");
var char = document.getElementById("char");
var city = document.getElementById("city");
var title = document.getElementById("title");
var imgs = new Array('1.jpg', '2.jpg', '3.jpg', '4.jpg');
var prices = new Array('2 000 000 $', '2 050 000 $', '3 000 000 $');
var titles = new Array(
  "«McLaren 720S Spider »",
  "«Lamborghini red»",
  "«Lamborghini green»",
);
var citys = new Array(
  "Київ",
  "Львів",
  "Одеса",
);
var texts = new Array(
  "Суперкар з'явився в 2019 році, виробник McLaren, що знаходиться в країніВеликобританія. Двигун McLaren 720S Spider об'ємом 3994 см³ розвиває потужність 720 кінських сил, що дозволяє автомобілю розганятися до 100 кілометрів на годину за 2.9 секунди та розвивати максимальну швидкість   341 км/год. Ціна McLaren 720S Spider - 320 000 $ або 21 120 000 ₽.", "Предлагаем Вашему вниманию жилой дом в Бзове, Барышевского района – 39 км от Киева. Расположен на участке 50 соток, со своим озером, которо разведён белый амур. Огорожен по периметру забором.",
  "Суперкар з'явився в 2019 році, виробник McLaren, що знаходиться в країніВеликобританія. Двигун McLaren 720S Spider об'ємом 3994 см³ розвиває потужність 720 кінських сил, що дозволяє автомобілю розганятися до 100 кілометрів на годину за 2.9 секунди та розвивати максимальну швидкість   341 км/год. Ціна McLaren 720S Spider - 320 000 $ або 21 120 000 ₽.", "Предлагаем Вашему вниманию жилой дом в Бзове, Барышевского района – 39 км от Киева. Расположен на участке 50 соток, со своим озером, которо разведён белый амур. Огорожен по периметру забором.",
  "Суперкар з'явився в 2019 році, виробник McLaren, що знаходиться в країніВеликобританія. Двигун McLaren 720S Spider об'ємом 3994 см³ розвиває потужність 720 кінських сил, що дозволяє автомобілю розганятися до 100 кілометрів на годину за 2.9 секунди та розвивати максимальну швидкість   341 км/год. Ціна McLaren 720S Spider - 320 000 $ або 21 120 000 ₽.", "Предлагаем Вашему вниманию жилой дом в Бзове, Барышевского района – 39 км от Киева. Расположен на участке 50 соток, со своим озером, которо разведён белый амур. Огорожен по периметру забором.",
);
var chars = new Array(
  [
    "341 км/ч",
    "2.9 сек",
    "720 л.с",
    "770 н.м. (при 5500 об/мин.).",
    "1468 кг",
    "2",
    "2021",
  ],
  [
    "241 км/ч",
    "12.9 сек",
    "720 л.с",
    "770 н.м. (при 5500 об/мин.).",
    "2468 кг",
    "2",
    "2019",
  ],
  [
    "441 км/ч",
    "1.9 сек",
    "520 л.с",
    "570 н.м. (при 5500 об/мин.).",
    "2468 кг",
    "2",
    "2020",
  ],
);
var j = imgs.length;

function img(l) {
  image1.src = './img/' + l + "/" + imgs[0];
  image2.src = './img/' + l + "/" + imgs[1];
  image3.src = './img/' + l + "/" + imgs[2];
  image4.src = './img/' + l + "/" + imgs[3];
  price.innerHTML = prices[l - 1];
  title.innerHTML = titles[l - 1];
  text.innerHTML = texts[l - 1];
  city.innerHTML = citys[l - 1];
  char.innerHTML = "";
  for (var i = 0; i < chars[l-1].length; i++) {
    char.innerHTML += "<p>" + chars[l-1][i] + "</p>";
  }

}
